javastraat/esp32_mmdvm_hotspot/boards/boards.txt
##############################################################

mmdvm.name=ESP32 MMDVM Board

mmdvm.bootloader.tool=esptool_py
mmdvm.bootloader.tool.default=esptool_py

mmdvm.upload.tool=esptool_py
mmdvm.upload.tool.default=esptool_py
mmdvm.upload.tool.network=esp_ota
mmdvm.upload.maximum_size=8257536
mmdvm.upload.maximum_data_size=327680
mmdvm.upload.flags=
mmdvm.upload.extra_flags=
mmdvm.upload.use_1200bps_touch=false
mmdvm.upload.wait_for_upload_port=false

mmdvm.serial.disableDTR=false
mmdvm.serial.disableRTS=false

mmdvm.build.tarch=xtensa
mmdvm.build.bootloader_addr=0x0
mmdvm.build.target=esp32s3
mmdvm.build.mcu=esp32s3
mmdvm.build.core=esp32
mmdvm.build.variant=esp32s3
mmdvm.build.board=ESP32S3_DEV

mmdvm.build.usb_mode=1
mmdvm.build.cdc_on_boot=1
mmdvm.build.msc_on_boot=0
mmdvm.build.dfu_on_boot=0
mmdvm.build.f_cpu=240000000L
mmdvm.build.flash_size=16MB
mmdvm.build.flash_freq=80m
mmdvm.build.flash_mode=dio
mmdvm.build.boot=qio
mmdvm.build.boot_freq=80m
mmdvm.build.partitions=ethelite_16MB
mmdvm.build.defines=-DBOARD_HAS_PSRAM
mmdvm.build.loop_core=-DARDUINO_RUNNING_CORE=1
mmdvm.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
mmdvm.build.psram_type=opi
mmdvm.build.memory_type={build.boot}_{build.psram_type}

## JTAG Adapter
mmdvm.menu.JTAGAdapter.default=Disabled
mmdvm.menu.JTAGAdapter.default.build.copy_jtag_files=0
mmdvm.menu.JTAGAdapter.builtin=Integrated USB JTAG
mmdvm.menu.JTAGAdapter.builtin.build.openocdscript=esp32s3-builtin.cfg
mmdvm.menu.JTAGAdapter.builtin.build.copy_jtag_files=1
mmdvm.menu.JTAGAdapter.external=FTDI Adapter
mmdvm.menu.JTAGAdapter.external.build.openocdscript=esp32s3-ftdi.cfg
mmdvm.menu.JTAGAdapter.external.build.copy_jtag_files=1
mmdvm.menu.JTAGAdapter.bridge=ESP USB Bridge
mmdvm.menu.JTAGAdapter.bridge.build.openocdscript=esp32s3-bridge.cfg
mmdvm.menu.JTAGAdapter.bridge.build.copy_jtag_files=1

## PSRAM
mmdvm.menu.PSRAM.opi=OPI PSRAM
mmdvm.menu.PSRAM.opi.build.defines=-DBOARD_HAS_PSRAM
mmdvm.menu.PSRAM.opi.build.psram_type=opi
mmdvm.menu.PSRAM.enabled=QSPI PSRAM
mmdvm.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
mmdvm.menu.PSRAM.enabled.build.psram_type=qspi
mmdvm.menu.PSRAM.disabled=Disabled
mmdvm.menu.PSRAM.disabled.build.defines=
mmdvm.menu.PSRAM.disabled.build.psram_type=qspi

## Flash Mode
mmdvm.menu.FlashMode.qio=QIO 80MHz
mmdvm.menu.FlashMode.qio.build.flash_mode=dio
mmdvm.menu.FlashMode.qio.build.boot=qio
mmdvm.menu.FlashMode.qio.build.boot_freq=80m
mmdvm.menu.FlashMode.qio.build.flash_freq=80m
mmdvm.menu.FlashMode.qio120=QIO 120MHz
mmdvm.menu.FlashMode.qio120.build.flash_mode=dio
mmdvm.menu.FlashMode.qio120.build.boot=qio
mmdvm.menu.FlashMode.qio120.build.boot_freq=120m
mmdvm.menu.FlashMode.qio120.build.flash_freq=80m
mmdvm.menu.FlashMode.dio=DIO 80MHz
mmdvm.menu.FlashMode.dio.build.flash_mode=dio
mmdvm.menu.FlashMode.dio.build.boot=dio
mmdvm.menu.FlashMode.dio.build.boot_freq=80m
mmdvm.menu.FlashMode.dio.build.flash_freq=80m
mmdvm.menu.FlashMode.opi=OPI 80MHz
mmdvm.menu.FlashMode.opi.build.flash_mode=dout
mmdvm.menu.FlashMode.opi.build.boot=opi
mmdvm.menu.FlashMode.opi.build.boot_freq=80m
mmdvm.menu.FlashMode.opi.build.flash_freq=80m

## Flash Size
mmdvm.menu.FlashSize.16M=16MB (128Mb)
mmdvm.menu.FlashSize.16M.build.flash_size=16MB
mmdvm.menu.FlashSize.8M=8MB (64Mb)
mmdvm.menu.FlashSize.8M.build.flash_size=8MB
mmdvm.menu.FlashSize.4M=4MB (32Mb)
mmdvm.menu.FlashSize.4M.build.flash_size=4MB
mmdvm.menu.FlashSize.32M=32MB (256Mb)
mmdvm.menu.FlashSize.32M.build.flash_size=32MB

## Loop Core
mmdvm.menu.LoopCore.1=Core 1
mmdvm.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
mmdvm.menu.LoopCore.0=Core 0
mmdvm.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

## Events Core
mmdvm.menu.EventsCore.1=Core 1
mmdvm.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
mmdvm.menu.EventsCore.0=Core 0
mmdvm.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

## USB Mode
mmdvm.menu.USBMode.hwcdc=Hardware CDC and JTAG
mmdvm.menu.USBMode.hwcdc.build.usb_mode=1
mmdvm.menu.USBMode.default=USB-OTG (TinyUSB)
mmdvm.menu.USBMode.default.build.usb_mode=0

## CDC On Boot
mmdvm.menu.CDCOnBoot.cdc=Enabled
mmdvm.menu.CDCOnBoot.cdc.build.cdc_on_boot=1
mmdvm.menu.CDCOnBoot.default=Disabled
mmdvm.menu.CDCOnBoot.default.build.cdc_on_boot=0

## MSC On Boot
mmdvm.menu.MSCOnBoot.default=Disabled
mmdvm.menu.MSCOnBoot.default.build.msc_on_boot=0
mmdvm.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
mmdvm.menu.MSCOnBoot.msc.build.msc_on_boot=1

## DFU On Boot
mmdvm.menu.DFUOnBoot.default=Disabled
mmdvm.menu.DFUOnBoot.default.build.dfu_on_boot=0
mmdvm.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
mmdvm.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

## Upload Mode
mmdvm.menu.UploadMode.default=UART0 / Hardware CDC
mmdvm.menu.UploadMode.default.upload.use_1200bps_touch=false
mmdvm.menu.UploadMode.default.upload.wait_for_upload_port=false
mmdvm.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
mmdvm.menu.UploadMode.cdc.upload.use_1200bps_touch=true
mmdvm.menu.UploadMode.cdc.upload.wait_for_upload_port=true

## Partition Scheme
mmdvm.menu.PartitionScheme.ethelite_16MB=16MB Flash (8MB APP with OTA/192KB SPIFFS)
mmdvm.menu.PartitionScheme.ethelite_16MB.build.partitions=ethelite_16MB
mmdvm.menu.PartitionScheme.ethelite_16MB.upload.maximum_size=8257536
mmdvm.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
mmdvm.menu.PartitionScheme.default.build.partitions=default
mmdvm.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
mmdvm.menu.PartitionScheme.huge_app.build.partitions=huge_app
mmdvm.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
mmdvm.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
mmdvm.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
mmdvm.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728

## CPU Frequency
mmdvm.menu.CPUFreq.240=240MHz (WiFi)
mmdvm.menu.CPUFreq.240.build.f_cpu=240000000L
mmdvm.menu.CPUFreq.160=160MHz (WiFi)
mmdvm.menu.CPUFreq.160.build.f_cpu=160000000L
mmdvm.menu.CPUFreq.80=80MHz (WiFi)
mmdvm.menu.CPUFreq.80.build.f_cpu=80000000L
mmdvm.menu.CPUFreq.40=40MHz
mmdvm.menu.CPUFreq.40.build.f_cpu=40000000L
mmdvm.menu.CPUFreq.20=20MHz
mmdvm.menu.CPUFreq.20.build.f_cpu=20000000L
mmdvm.menu.CPUFreq.10=10MHz
mmdvm.menu.CPUFreq.10.build.f_cpu=10000000L

## Upload Speed
mmdvm.menu.UploadSpeed.921600=921600
mmdvm.menu.UploadSpeed.921600.upload.speed=921600
mmdvm.menu.UploadSpeed.115200=115200
mmdvm.menu.UploadSpeed.115200.upload.speed=115200
mmdvm.menu.UploadSpeed.256000.windows=256000
mmdvm.menu.UploadSpeed.256000.upload.speed=256000
mmdvm.menu.UploadSpeed.230400.windows.upload.speed=256000
mmdvm.menu.UploadSpeed.230400=230400
mmdvm.menu.UploadSpeed.230400.upload.speed=230400
mmdvm.menu.UploadSpeed.460800.linux=460800
mmdvm.menu.UploadSpeed.460800.macosx=460800
mmdvm.menu.UploadSpeed.460800.upload.speed=460800
mmdvm.menu.UploadSpeed.512000.windows=512000
mmdvm.menu.UploadSpeed.512000.upload.speed=512000

## Debug Level
mmdvm.menu.DebugLevel.none=None
mmdvm.menu.DebugLevel.none.build.code_debug=0
mmdvm.menu.DebugLevel.error=Error
mmdvm.menu.DebugLevel.error.build.code_debug=1
mmdvm.menu.DebugLevel.warn=Warn
mmdvm.menu.DebugLevel.warn.build.code_debug=2
mmdvm.menu.DebugLevel.info=Info
mmdvm.menu.DebugLevel.info.build.code_debug=3
mmdvm.menu.DebugLevel.debug=Debug
mmdvm.menu.DebugLevel.debug.build.code_debug=4
mmdvm.menu.DebugLevel.verbose=Verbose
mmdvm.menu.DebugLevel.verbose.build.code_debug=5

## Erase Flash
mmdvm.menu.EraseFlash.none=Disabled
mmdvm.menu.EraseFlash.none.upload.erase_cmd=
mmdvm.menu.EraseFlash.all=Enabled
mmdvm.menu.EraseFlash.all.upload.erase_cmd=-e

## Zigbee Mode
mmdvm.menu.ZigbeeMode.default=Disabled
mmdvm.menu.ZigbeeMode.default.build.zigbee_mode=
mmdvm.menu.ZigbeeMode.default.build.zigbee_libs=
mmdvm.menu.ZigbeeMode.zczr=Zigbee ZCZR (coordinator/router)
mmdvm.menu.ZigbeeMode.zczr.build.zigbee_mode=-DZIGBEE_MODE_ZCZR
mmdvm.menu.ZigbeeMode.zczr.build.zigbee_libs=-lesp_zb_api.zczr -lzboss_stack.zczr -lzboss_port

##############################################################

espnowatch.name= ESPNOW LilyGo T-Watch 2020

espnowatch.bootloader.tool=esptool_py
espnowatch.bootloader.tool.default=esptool_py

espnowatch.upload.tool=esptool_py
espnowatch.upload.tool.default=esptool_py
espnowatch.upload.tool.network=esp_ota
espnowatch.upload.maximum_size=8257536
espnowatch.upload.maximum_data_size=327680
espnowatch.upload.flags=
espnowatch.upload.extra_flags=
espnowatch.upload.use_1200bps_touch=false
espnowatch.upload.wait_for_upload_port=false
espnowatch.upload.speed=921600

espnowatch.serial.disableDTR=false
espnowatch.serial.disableRTS=false

espnowatch.build.tarch=xtensa
espnowatch.build.bootloader_addr=0x1000
espnowatch.build.target=esp32
espnowatch.build.mcu=esp32
espnowatch.build.core=esp32
espnowatch.build.variant=esp32
espnowatch.build.board=ESP32_DEV

espnowatch.build.f_cpu=240000000L
espnowatch.build.flash_size=16MB
espnowatch.build.flash_freq=80m
espnowatch.build.flash_mode=dio
espnowatch.build.boot=qio
espnowatch.build.partitions=twatch_16MB
espnowatch.build.defines=-DBOARD_HAS_PSRAM
espnowatch.build.loop_core=-DARDUINO_RUNNING_CORE=1
espnowatch.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
espnowatch.build.code_debug=0

## PSRAM
espnowatch.menu.PSRAM.enabled=Enabled
espnowatch.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
espnowatch.menu.PSRAM.disabled=Disabled
espnowatch.menu.PSRAM.disabled.build.defines=

## Flash Mode
espnowatch.menu.FlashMode.qio=QIO 80MHz
espnowatch.menu.FlashMode.qio.build.flash_mode=dio
espnowatch.menu.FlashMode.qio.build.boot=qio
espnowatch.menu.FlashMode.qio.build.flash_freq=80m
espnowatch.menu.FlashMode.dio=DIO 80MHz
espnowatch.menu.FlashMode.dio.build.flash_mode=dio
espnowatch.menu.FlashMode.dio.build.boot=dio
espnowatch.menu.FlashMode.dio.build.flash_freq=80m

## Flash Size
espnowatch.menu.FlashSize.16M=16MB (128Mb)
espnowatch.menu.FlashSize.16M.build.flash_size=16MB

## Partition Scheme
espnowatch.menu.PartitionScheme.twatch_16MB=16MB Flash (8MB APP/OTA + 192KB SPIFFS)
espnowatch.menu.PartitionScheme.twatch_16MB.build.partitions=twatch_16MB
espnowatch.menu.PartitionScheme.twatch_16MB.upload.maximum_size=8257536

## CPU Frequency
espnowatch.menu.CPUFreq.240=240MHz (WiFi/BT)
espnowatch.menu.CPUFreq.240.build.f_cpu=240000000L
espnowatch.menu.CPUFreq.160=160MHz (WiFi)
espnowatch.menu.CPUFreq.160.build.f_cpu=160000000L
espnowatch.menu.CPUFreq.80=80MHz (WiFi)
espnowatch.menu.CPUFreq.80.build.f_cpu=80000000L

## Loop Core
espnowatch.menu.LoopCore.1=Core 1
espnowatch.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
espnowatch.menu.LoopCore.0=Core 0
espnowatch.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

## Events Core
espnowatch.menu.EventsCore.1=Core 1
espnowatch.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
espnowatch.menu.EventsCore.0=Core 0
espnowatch.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

## Upload Speed
espnowatch.menu.UploadSpeed.921600=921600
espnowatch.menu.UploadSpeed.921600.upload.speed=921600
espnowatch.menu.UploadSpeed.460800=460800
espnowatch.menu.UploadSpeed.460800.upload.speed=460800
espnowatch.menu.UploadSpeed.115200=115200
espnowatch.menu.UploadSpeed.115200.upload.speed=115200

## Debug Level
espnowatch.menu.DebugLevel.none=None
espnowatch.menu.DebugLevel.none.build.code_debug=0
espnowatch.menu.DebugLevel.error=Error
espnowatch.menu.DebugLevel.error.build.code_debug=1
espnowatch.menu.DebugLevel.info=Info
espnowatch.menu.DebugLevel.info.build.code_debug=3
espnowatch.menu.DebugLevel.debug=Debug
espnowatch.menu.DebugLevel.debug.build.code_debug=4
espnowatch.menu.DebugLevel.verbose=Verbose
espnowatch.menu.DebugLevel.verbose.build.code_debug=5

## Erase Flash
espnowatch.menu.EraseFlash.none=Disabled
espnowatch.menu.EraseFlash.none.upload.erase_cmd=
espnowatch.menu.EraseFlash.all=Enabled
espnowatch.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

twatch.name= LilyGo T-Watch 2020

twatch.bootloader.tool=esptool_py
twatch.bootloader.tool.default=esptool_py

twatch.upload.tool=esptool_py
twatch.upload.tool.default=esptool_py
twatch.upload.tool.network=esp_ota
twatch.upload.maximum_size=8257536
twatch.upload.maximum_data_size=327680
twatch.upload.flags=
twatch.upload.extra_flags=
twatch.upload.use_1200bps_touch=false
twatch.upload.wait_for_upload_port=false
twatch.upload.speed=921600

twatch.serial.disableDTR=false
twatch.serial.disableRTS=false

twatch.build.tarch=xtensa
twatch.build.bootloader_addr=0x1000
twatch.build.target=esp32
twatch.build.mcu=esp32
twatch.build.core=esp32
twatch.build.variant=esp32
twatch.build.board=ESP32_DEV

twatch.build.f_cpu=240000000L
twatch.build.flash_size=16MB
twatch.build.flash_freq=80m
twatch.build.flash_mode=dio
twatch.build.boot=qio
twatch.build.partitions=twatch_16MB
twatch.build.defines=-DBOARD_HAS_PSRAM
twatch.build.loop_core=-DARDUINO_RUNNING_CORE=1
twatch.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
twatch.build.code_debug=0

## PSRAM
twatch.menu.PSRAM.enabled=Enabled
twatch.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
twatch.menu.PSRAM.disabled=Disabled
twatch.menu.PSRAM.disabled.build.defines=

## Flash Mode
twatch.menu.FlashMode.qio=QIO 80MHz
twatch.menu.FlashMode.qio.build.flash_mode=dio
twatch.menu.FlashMode.qio.build.boot=qio
twatch.menu.FlashMode.qio.build.flash_freq=80m
twatch.menu.FlashMode.dio=DIO 80MHz
twatch.menu.FlashMode.dio.build.flash_mode=dio
twatch.menu.FlashMode.dio.build.boot=dio
twatch.menu.FlashMode.dio.build.flash_freq=80m

## Flash Size
twatch.menu.FlashSize.16M=16MB (128Mb)
twatch.menu.FlashSize.16M.build.flash_size=16MB

## Partition Scheme
twatch.menu.PartitionScheme.twatch_16MB=16MB Flash (8MB APP/OTA + 192KB SPIFFS)
twatch.menu.PartitionScheme.twatch_16MB.build.partitions=twatch_16MB
twatch.menu.PartitionScheme.twatch_16MB.upload.maximum_size=8257536

## CPU Frequency
twatch.menu.CPUFreq.240=240MHz (WiFi/BT)
twatch.menu.CPUFreq.240.build.f_cpu=240000000L
twatch.menu.CPUFreq.160=160MHz (WiFi)
twatch.menu.CPUFreq.160.build.f_cpu=160000000L
twatch.menu.CPUFreq.80=80MHz (WiFi)
twatch.menu.CPUFreq.80.build.f_cpu=80000000L

## Loop Core
twatch.menu.LoopCore.1=Core 1
twatch.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
twatch.menu.LoopCore.0=Core 0
twatch.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

## Events Core
twatch.menu.EventsCore.1=Core 1
twatch.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
twatch.menu.EventsCore.0=Core 0
twatch.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

## Upload Speed
twatch.menu.UploadSpeed.921600=921600
twatch.menu.UploadSpeed.921600.upload.speed=921600
twatch.menu.UploadSpeed.460800=460800
twatch.menu.UploadSpeed.460800.upload.speed=460800
twatch.menu.UploadSpeed.115200=115200
twatch.menu.UploadSpeed.115200.upload.speed=115200

## Debug Level
twatch.menu.DebugLevel.none=None
twatch.menu.DebugLevel.none.build.code_debug=0
twatch.menu.DebugLevel.error=Error
twatch.menu.DebugLevel.error.build.code_debug=1
twatch.menu.DebugLevel.info=Info
twatch.menu.DebugLevel.info.build.code_debug=3
twatch.menu.DebugLevel.debug=Debug
twatch.menu.DebugLevel.debug.build.code_debug=4
twatch.menu.DebugLevel.verbose=Verbose
twatch.menu.DebugLevel.verbose.build.code_debug=5

## Erase Flash
twatch.menu.EraseFlash.none=Disabled
twatch.menu.EraseFlash.none.upload.erase_cmd=
twatch.menu.EraseFlash.all=Enabled
twatch.menu.EraseFlash.all.upload.erase_cmd=-e
